# RegisterService Method

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
ExternalServiceRegistry..::..RegisterService Method
ExternalServiceRegistry Class See Also
---
# Overload List
| Name | Description |
| --- | --- |
| --- | --- | --- |
| RegisterService(ISingleServerService, ExternalServiceOptions) | A method to register a single-server service. |
| RegisterService(IMultiServerService, ExternalServiceOptions, ExecutionPolicy) | A method to register a multi-server service. |
| RegisterService(ISingleServerService, Guid, ExternalServiceOptions) | A method to register a mandatory, single-server service. |

# See Also
ExternalServiceRegistry Class
ExternalServiceRegistry Members
Autodesk.Revit.DB.ExternalService Namespace